trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/РабочееМестоКладовщикаАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКладовщикаАльтерра</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаПоступление</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c9e23b65-d2dd-4d5e-91a1-60a62757322c">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4979558b-bd14-48f3-a52d-805e31ec5e65">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8187f1a4-6517-4240-ace4-08511908ce30">
    <name>ВходящийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4058b5f7-fa3b-4b4e-abe9-cf3afe19677f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f4ff2bf1-a8d5-487c-98fc-c15da9a88779">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/Forms/ФормаПриемПоРейсу_СообщитьОбОшибке/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийСотрудникТСД") Тогда
		ТекущийСотрудникТСД = Параметры.ТекущийСотрудникТСД;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокОрдеров") Тогда
		Для Каждого Ордер Из Параметры.СписокОрдеров Цикл
			Если ЗначениеЗаполнено(Ордер) Тогда
				НС = ОрдераИРаспоряжения.Добавить();
				НС.Ордер = Ордер;
				
				ОпределитьАвтора(Ордер, НС);
			КонецЕсли;
		КонецЦикла; 
		
		Если ОрдераИРаспоряжения.Количество() = 0 Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет ордеров!");
		ИначеЕсли ОрдераИРаспоряжения.Количество() = 1 Тогда
			ОрдераИРаспоряжения[0].Отметка = Истина;
			Элементы.ОрдераИРаспоряжения.Видимость = Ложь;
		КонецЕсли;                      
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОпределитьАвтора(Ордер, СтрокаТЧ)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка,
		|	ПриходныйОрдерНаТовары.Распоряжение КАК Распоряжение,
		|	ПриходныйОрдерНаТовары.Распоряжение.Автор КАК ЗаказПоставщику_Автор,
		|	ЗаказНаДоставкуОтПоставщика.Ссылка КАК ЗаказНаДоставкуОтПоставщика,
		|	ЗаказНаДоставкуОтПоставщика.Ссылка.Автор КАК ЗаказНаДоставкуОтПоставщика_Автор,
		|	РейсОтПоставщика.Ссылка КАК РейсОтПоставщика,
		|	РейсОтПоставщика.Ссылка.Автор КАК РейсОтПоставщика_Автор
		|ИЗ
		|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставкуОтПоставщика.Основания КАК ЗаказНаДоставкуОтПоставщика
		|		ПО (ЗаказНаДоставкуОтПоставщика.Документ = ПриходныйОрдерНаТовары.Распоряжение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщика
		|		ПО (РейсОтПоставщика.ЗаказНаДоставку = ЗаказНаДоставкуОтПоставщика.Ссылка)
		|ГДЕ
		|	ПриходныйОрдерНаТовары.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
		|	И ПриходныйОрдерНаТовары.Ссылка = &Ордер";

	Запрос.УстановитьПараметр("Ордер", Ордер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.РейсОтПоставщика_Автор) Тогда
			СтрокаТЧ.Автор = Выборка.РейсОтПоставщика_Автор;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЗаказПоставщику_Автор) Тогда
			СтрокаТЧ.Автор = Выборка.ЗаказПоставщику_Автор;
		ИначеЕсли ЗначениеЗаполнено(ТекущийСотрудникТСД) Тогда 
			СтрокаТЧ.Автор = ТекущийСотрудникТСД;
		Иначе
			СтрокаТЧ.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПропускНеСоответствуетЗаказу(Команда)
	ОбработатьОрдера_НаКлиенте("Заказ поставщика не соответствует товару");
КонецПроцедуры

&НаКлиенте
Процедура ФиктивныйКроссДокинг(Команда)
	ОбработатьОрдера_НаКлиенте("Фиктивный кросс-докинг, товар пришел не по местам");
КонецПроцедуры

&НаКлиенте
Функция ОбработатьОрдера_НаКлиенте(ШаблонСообщения)
	Если НЕ ЗначениеЗаполнено(ОрдераИРаспоряжения.НайтиСтроки(Новый Структура("Отметка", Истина))) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите необходимые ордера из списка!");
	ИначеЕсли ОбработатьОрдера_НаСервере(ШаблонСообщения) Тогда
		Закрыть("Данные отправлены в Битрикс!");
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОбработатьОрдера_НаСервере(ШаблонСообщения)
	Если АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
		Для Каждого Стр Из ОрдераИРаспоряжения Цикл
			Если Стр.Отметка И 
				НЕ Стр.БПЗапущен И 
				НЕ СоздатьБП(ШаблонСообщения, Стр) Тогда
				
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Механизм действует только в рабочей базе!");
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере	
Функция ПодразделениеПользователя(Автор)

	Подразделение = "" + Автор.Подразделение;
	
	Если СтрНайти(Подразделение, "Центр") > 0 Тогда 
		Возврат "941"; // Центральный офис 
	ИначеЕсли СтрНайти(Подразделение, "Барнаул") > 0 Тогда
		Возврат "942"; // Филиал Барнаул
	ИначеЕсли СтрНайти(Подразделение, "Бийск") > 0 Тогда
		Возврат "943"; // Филиал Бийск
	ИначеЕсли СтрНайти(Подразделение, "Выбор") > 0 Тогда
		Возврат "26644"; // Филиал Выбор
	ИначеЕсли СтрНайти(Подразделение, "Новоалтайск") > 0 Тогда
		Возврат "944"; // Филиал Новоалтайск
	ИначеЕсли СтрНайти(Подразделение, "Майма") > 0 Тогда
		Возврат "26435"; // Филиал Майма
	ИначеЕсли СтрНайти(Подразделение, "Альтерра") > 0 Тогда
		Возврат "945"; // ТГ Альтерра
	ИначеЕсли СтрНайти(Подразделение, "МД") > 0 Тогда
		Возврат "5402"; // Магазин у дома
	Иначе
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подразделение пользователя не удалось определить!");
		Возврат "";
	КонецЕсли;
	
КонецФункции     

&НаСервере	
Функция ОтделПользователя(Автор)
	
	Если ТипЗнч(Автор) <> Тип("СправочникСсылка.Сотрудники") Тогда
		Возврат "939"; // все отделы
	КонецЕсли;

	Отдел = "" + Автор.Отдел;

	Если СтрНайти(Отдел, "Бухгалтер") > 0 Тогда // Бухгалтерия
		Возврат "929"; // Бухгалтерия
	ИначеЕсли СтрНайти(Отдел, "Касса") > 0 Тогда // Касса
		Возврат "928"; // Касса
	ИначеЕсли СтрНайти(Отдел, "Коммерческий") > 0 Тогда // Коммерческий отдел
		Возврат "26262"; // Коммерческий отдел
	ИначеЕсли СтрНайти(Отдел, "Контактный") > 0 Тогда // Контактный центр
		Возврат "1225"; // Контактный центр              
	ИначеЕсли СтрНайти(Отдел, "информационных") > 0 Тогда // Отдел информационных технологий
		Возврат "936"; // ИТ-отдел
	ИначеЕсли СтрНайти(Отдел, "аналитик") > 0 Тогда // Отдел аналитики и развития бизнеса
		Возврат "937"; // Отдел аналитики           
	ИначеЕсли СтрНайти(Отдел, "качества") > 0 Тогда // Отдел качества и материального контроля
		Возврат "932"; // Отдел качества
	ИначеЕсли СтрНайти(Отдел, "логист") > 0 Тогда // Отдел транспортной логистики
		Возврат "938"; // Отдел логистики
	ИначеЕсли СтрНайти(Отдел, "реклам") > 0 Тогда // Сектор рекламы
		Возврат "935"; // Сектор рекламы        
	ИначеЕсли СтрНайти(Отдел, "поставок") > 0 Тогда // Отдел поставок
		Возврат "927"; // Отдел поставок
	ИначеЕсли СтрНайти(Отдел, "развития") > 0 Тогда // Отдел развития
		Возврат "940"; // Отдел развития
	ИначеЕсли СтрНайти(Отдел, "Склад") > 0 ИЛИ Отдел = "РСК" ИЛИ Отдел = "РСН" ИЛИ СтрНайти(Отдел, "Секция") > 0 Тогда // Склад
		Возврат "924"; // Склад           
	ИначеЕсли СтрНайти(Отдел, "инженер") > 0 Тогда // Служба главного инженера
		Возврат "931"; // Служба гл. инженера
	ИначеЕсли СтрНайти(Отдел, "персонал") > 0 Тогда // Служба персонала
		Возврат "934"; // Служба персонала
	ИначеЕсли СтрНайти(Отдел, "Торгов") > 0 Тогда // Торговый зал
		Возврат "925"; // Торговый зал/сектор выписки
	ИначеЕсли СтрНайти(Отдел, "Юридический") > 0 Тогда // Юридический отдел
		Возврат "930"; // Юр. отдел
	ИначеЕсли СтрНайти(Отдел, "Оптов") > 0 Тогда // Отдел оптовых продаж
		Возврат "926"; // Оптовый отдел
	ИначеЕсли СтрНайти(Отдел, "безопас") > 0 Тогда // Служба безопасности
		Возврат "933"; // Служба безопасности
	Иначе
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отдел пользователя не удалось определить!");
		Возврат "939"; // все отделы 
	КонецЕсли;

КонецФункции

&НаСервере	
Функция СоздатьБП(ШаблонСообщения, СтрокаТЧ)
	
	FIELDS = Новый Структура;

	FIELDS.Вставить("NAME", "Обращение");
	FIELDS.Вставить("CREATED_BY", АльтерраВзаимодействиеСБитрикс24.ПолучитьИДПользователя(СтрокаТЧ.Автор)); // Автор обращения 

	FIELDS.Вставить("PROPERTY_404", "918"); // Вид обращения (918 - Нарушение процессов, 916 - Предложение по улучшению)
	FIELDS.Вставить("PROPERTY_405", "" + СтрокаТЧ.Автор); // От кого исходит обращение (заполняется, если автор процесса отличается от автора обращения)
	FIELDS.Вставить("PROPERTY_3973", "Да"); // Требуется согласование автора


	FIELDS.Вставить("DETAIL_TEXT", 
		СтрШаблон(ШаблонСообщения + ", Поставщик - %1. №%2", СтрокаТЧ.Ордер.Отправитель, СтрокаТЧ.Ордер.Распоряжение.Номер) +
		Символы.ПС + Символы.ПС + "(Автор обращения: " + ТекущийСотрудникТСД + ")"); // Суть обращения

	FIELDS.Вставить("PROPERTY_413", ПодразделениеПользователя(СтрокаТЧ.Автор));
	FIELDS.Вставить("PROPERTY_408", ОтделПользователя(СтрокаТЧ.Автор));
	FIELDS.Вставить("PROPERTY_1487", "7328"); // Процесс для улучшения/ с нарушением

	Попытка
		НовыйЭлемент = АльтерраВзаимодействиеСБитрикс24.ДобавитьНовыйЭлементСписка(
			"bitrix_processes",
			"95", // Обращения/жалобы сотрудников
			Строка(Новый УникальныйИдентификатор), 
			FIELDS);    
			
		Если ТипЗнч(НовыйЭлемент) = Тип("Структура") И 
			НовыйЭлемент.Свойство("result") И 
			ТипЗнч(НовыйЭлемент.result) = Тип("Число") И 
			НовыйЭлемент.result <> 0 Тогда
			
			СтрокаТЧ.БПЗапущен = Истина;
			Возврат Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить сообщение...");
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Исключение: Не удалось отправить сообщение... " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции
